#-*- coding: utf-8 -*-
'''
Created on 05.06.2011

@author: dik
'''

podst = [[['б д е с а', 1.0], ['б, д, е, с, а', 1.0], ['бдеса', 1.0], ['б,д,е,с,а', 1.0], ['б,д,е,с.а', 1.0]],
         [['модем', 1.0], ['модулятор-демодулятор', 1.0], ['модем или кабель', 0.5]],
         [['сигнала', 1.0], ['сигнал', 1.0], ['сигналов', 1.0], ['сигналов и сообщении', 0.5], ['совокупности сигналов', 1.0], ['сигналов или сообщений', 0.5]],
         [['прикладному', 1.0], ['прикладной', 1.0], ['Прикладное', 1.0], ['к прикладному', 1.0], ['прикладное', 1.0], ['Прикладное ПО', 1.0], ['прикладное ПО', 1.0], ['прикладное по', 1.0], ['к прикладной', 1.0]],
         [['информация', 1.0], ['информацией', 1.0], ['Информация', 1.0]],
         [['системное', 1.0], ['системного', 1.0], ['системные', 1.0], ['Системные', 1.0], ['системным', 1.0], ['базовое ПО', 0.5], ['базовые ПО', 0.5]],
         [['системная шина', 1.0], ['система шины', 1.0]]
         ]